ArtShare/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "users" ON "users"."id" = "artworks"."artist_id" WHERE "artworks"."artist_id" = $1  [["artist_id", 3]]
---
    def index
        #debugger
        if params[:user_id].equal?(:artist_id)
            @artworks = Artwork.joins(:artist).where(artist_id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def update
        @artwork = Artwork.find(params[:id])