ArtShare/app/controllers/users_controller.rb

    def create
        #debugger
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Evan"], ["created_at", "2021-09-16 20:26:29.602585"], ["updated_at", "2021-09-16 20:26:29.602585"]]